rails-task-manager/app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("title", "details", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "swagout"], ["details", ":)"], ["completed", 0], ["created_at", "2024-02-20 13:03:11.823386"], ["updated_at", "2024-02-20 13:03:11.823386"]]

  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "swagout6"], ["updated_at", "2024-02-20 13:40:29.871725"], ["id", 4]]